#include <cmath>    // математические функции
#include <locale.h> // функции, устанавливающие национальные кодировки символов
#include <iostream> // Эта - часть библиотеки STL (Standard Template Library)
#include <climits>   // Полезные константы
#include <cfloat>   // Для FLT_MAX_EXP, DBL_MAX, DBL_EPSILON и т.д.

using namespace std; // Обеспечивает видимость имен STL
#ifdef NDEBUG
#define stop asm("nop")
#else
#define stop asm("int3")
#endif
// Эта макроподстановка упрощает установку точек останова

int n; // Глобальная переменная. По умолчанию она обнуляется.

namespace space // В пространстве имен - space
{
    int n = 1; // Объявлена переменная n
} // space определяет область видимости этой переменной
// cmake -DCMAKE_CXX_FLAGS="-O0 -g" ..
int main()
{
    setlocale(LC_ALL, "");
    // Выполняя программу по шагам, следите за значениями переменных  и интерпретируйте результат, объясняя себе
    // наблюдаемые значения. Обратите внимание на разную интерпретацию отладчиком  signed и unsigned типов данных.
    char c = 'A'; // 65 'A' 0x41
    // В комментарии справа полезно проставить десятичное символьное и шестнадцатиричное
    // значения переменной после выполнения указанной строки. Вы должны видеть их в окне Autos.
    c = 0x42;     // 66 'B' 0x42
    c = -1;       // 255 'я' 0xff (если unsigned char) или -1 (если signed char)
    c = CHAR_BIT; // 8 '\b' 0x08 Размер переменной типа char
    stop;

    // В комментариях напишите результат, возвращаемый оператором sizeof для
    // переменной типа wchar_t (ее размер)
    wchar_t cw = L'Ф';
    size_t ns = sizeof(cw); // 2 байта

    unsigned char uc = 0x41; // 65 'A' 0x41
    uc = 'B';                // 66 'B' 0x42
    uc = -1;                 // 255 '' 0xff, ascii - 'ÿ'
    stop;

    int i = 1; // 1 0x00000001
    i = -1;    // -1 0xffffffff
    stop;

    unsigned int ui = 1; // 1 0x00000001
    ui = -1;             // 4294967295 0xffffffff (максимальное значение)

    short s = static_cast<short>(0xffff); // Здесь compiler генерирует warning. Измените код, чтобы убрать warning
    // мой компилятор не генерирует предупреждение, но я погуглил и предупреждение здесь возникает из-за знакового переполнения и -1 в переменной
    s = short(0xffff); // -1 0xffff
    s = 1;             // 1 0x0001

    //==== Измените код, чтобы убрать warning
    // здесь нет предупреждений, у нас в unsigned short вмещается 0xffff
    unsigned short us = 0xffff; // 65535 0xffff
    us = 5;                     // 5 0x0005

    // здесь представление однозначное, ничего не нужно делать
    long l = 0xffffffff; // -1 0xffffffff
    l = -128;            // -128 0x00000080

    l = FLT_MAX_EXP; // 128 - максимальная степень двойки числа до бесконечности для float. следующая степени вызовет переполнение и число превратится в Infinity
    l = DBL_MAX_EXP; // 1024 - максимальная степень двойки числа до бесконечности для double. следующая степени вызовет переполнение и число превратится в Infinity

    l = FLT_MANT_DIG; // 24 - бит под мантиссу для типа float
    l = DBL_DIG;      // 15 - максимальная точность знаков после запятой для типа double

    l = DBL_MANT_DIG; // 53 - бит под мантиссу для типа double

    // нет предупреждения, но нужно добавить f, потому что по умолчанию такие числа - double
    float f = -12.56f; // -12.5600004
    f = -1.e-27f;      // -1.00000003e-27

    f = FLT_MAX; // 3.40282347e+38 - максимальное значение float
    f = FLT_MIN; // 1.17549435e-38 - минимальное положительное значение float

    // здесь из-за оптимизаций компилятора пришлось пересобрать с флагом -O0
    double d = 0.1234567890123456789123456789; // 0.12345678901234568
    d = -0.123456789012345e+306;               // -1.2345678901234499e+305
    d = DBL_MAX;                               // 1.7976931348623157e+308
    d = DBL_MIN;                               // 2.2250738585072014e-308
    d = DBL_EPSILON;                           // 2.2204460492503131e-16

    uc = ~0; // 255 ''
    i = ~0;  // ~(0x00000000) = 0xffffffff = -1
    stop;
    // Раннее (при компиляции) или неявное приведение типов данных
    // Объясните те значения, которые вы наблюдаете в окне Autos. Определите порядок выполения присваиваний.
    d = f = i = s = c = 1 / 3;   // 1 / 3 (целочисленное деление) = 0. все переменные теперь 0
    c = s = i = f = d = 100 / 3; // 100 / 3 результат 33. c, s, i теперь 33. f, d теперь 33.0
    c = s = i = f = d = 10 / 3;  // 10 / 3 результат 3. c, s, i теперь 3. f, d теперь 3.0
    c = s = i = f = d = 1 / 3.;  // d = 0.33333333333333331, f = 0.333333343, c,s,i = 0

    // Пример "небрежного" использования неявного приведения типов.	 Объясните результаты.
    // 256 в hex = 0x0100. переменная char хранит 1 байт, берется младший (0x00), поэтому c = 0
    i = 256; // 256 = 0x0100
    c = i;   // 0 = 0x00

    // 255 + 2 = 257 (0x0101). char берет только младший байт (0x01), поэтому sum = 1
    uc = 255;                          // 255 ''
    unsigned char u = 2, sum = uc + u; // sum = 1 = 0x01
    stop;

    // Явное приведение типов	Объясните разницу результатов в строках (3) и (4)
    i = 100;
    f = d = i / 3;                      // (3) целочисленное деление, f = d = 33.0
    f = d = (double)i / 3;              // (4) i приведено к double, деление вещественное d = 33.333333333333336, f = 33.3333321, i / 3 = 33.(3)
    f = d = double(i) / 3;              // (4) то же самое, что и выше
    f = d = static_cast<double>(i) / 3; // (4) безопасное C++ приведение
    stop;

    // Область действия, область видимости и время существования. В этом фрагменте фигурируют четыре
    //  переменных с одним и тем же именем n.  Одна - глобальная, вторая определена в своем пространстве имен,
    // третья - локальная внутри функции main(), четвертая - локальная внутри блока.
    //  Обратите внимание, что глобальная переменная и та, что в пространстве имен space - объявлены вне функции main()
    // Определите, к какой из четырех переменных идет обращение, cформулируйте область действия и область видимости
    // каждой переменной. Для выполнения задания рекомендуется пользоваться  закладкой "Watches" или "Locals" окна
    // "Autos". Подсказка: В окно "Watches" можно поместить сразу все переменные (n, ::n, и space::n)
    n = 100;        // обращение к глобальной ::n, так как локальная еще не объявлена
    space::n = 200; // обращение к n в пространстве имен space
    n++;            // ::n становится 101
    int n;          // локальная переменная живет отсюда и до конца main
    n = 10;         // обращение к локальной n
    ::n++;          // явное обращение к глобальной ::n -> становится 102

    {               //  Начало блока
        int n;      // локальная переменная блока живёт до }
        n = -1;     // n блока
        n++;        // n блока становится 0
        ::n++;      // глобальная ::n становится 103
        space::n++; // space::n становится 201
    } // Конец блока, переменная n из блока уничтожается
    n--;        // локальная n в main становится 9
    ::n--;      // глобальная ::n становится 102
    space::n--; // space::n становится 200

    // Спецификатор класса памяти - static Выполняя задание по шагам, обратите внимание на  разное поведение
    // переменных nLoc и nStat
    {
    Again:
        int outer;
        for (int i = 0; i < 5; i++)
        {
            // nStat живет всё время выполнения программы, инициализируется 0
            // nLoc пересоздается каждую итерацию цикла и обнуляется
            // nLoc всегда 1, nStat растет до 10
            static int nStat;
            {
                int nLoc = 0;
                nLoc++;
                nStat++;
            }
            outer = nStat;
        }
        if (outer < 10)
            goto Again;
    }
    // Перечисления - enum. Обратите внимание на явную и неявную инициализацию констант
    enum RANK
    {
        One,             // 0
        Two,             // 1
        Three,           // 2
        Four,            // 3
        Jack = 6,        // 6
        Queen,           // 7
        Ace = Queen + 3, // 10
        Joker = 20       // 20
    };
    typedef RANK RANG;

    RANG r = Jack;
    if (r == Jack)
        r = Queen;

    if (r == Queen)
    {
        // Любой целочисленной переменной можно присвоить enum-переменную
        int i = r;
        r = RANK(i++); // Обратное преобразование надо указывать явно
        i = r;
        r = RANK(++i);
        i = r;
    }
    RANK rr = Ace;
    stop;
    //	Логический тип bool.	Выполняя задание по шагам, следите за значениями переменной b
    {
        int n = 127;
        bool b = n != 0; // 1
        b = n == 0;      // 0
        b = n > 0;       // 1
        b = n <= 0;      // 0
        b = n > 1;       // 1

        int num = static_cast<int>(b); // num = 1
        if (b)
            cout << "\n\t My flag is: true" << "   or: " << b
                 << "\n\t Conversion to int: " << num << endl;
        b = n == num; // false (т.к. 127 != 1)
        cout << "\n\t Now the flag is: false" << "   or: " << b;
    }

    //	Модификатор const
    const double pi = acos(-1.);            // 3.1415926535897931
    double space_permiability = 4.e-7 * pi; //	Магнитная проницаемость пустоты 1.2566370614359173e-06
    const int dozen = 12;
    int var = dozen; // 12

    // assignment of read-only variable 'dozen'
    // dozen = 1;
    //	Директивы условной трансляции. Объясните значение, которое принимает переменная version.
    //	Что нужно сделать для того, чтобы результат был другим?

    // чтобы version была "version 3.11", нужно закомментировать #define _MSVER400
    // и добавить #define _MSVER311
    // если убрать все #define ... , будет "version Unknown"

#define _MSVER400
    const char *version;
#if defined _MSVER400
    version = "version 4.00";
#elif defined _MSVER311
    version = "version 3.11";
#else
    version = "version Unknown";
#endif

    cout << endl
         << version;
    stop;

    // В окне ClassView или Solution Explorer поставьте фокус на имя проекта дайте команду Project/Properties.
    //	В диалоге Property Pages щелкните на папке Configuration Properties, убедитесь, что в разделе Code Generation
    //	установлена константа компиляции _DEBUG. Создайте директивы препроцессора и код С++, которые
    //	в зависимости от действующей конфигурации проекта (_DEBUG или NDEBUG) выводят соответствующее
    //	сообщение. Измените конфигурацию проекта (в диалоге Property Pages) и проверьте ваш код.
    //	Чтобы изменить конфигурацию пользуйтесь кнопкой Configuration Manager

#ifdef NDEBUG
    cout << "Current configuration: RELEASE (Optimization Enabled)" << endl;
#else
    cout << "Current configuration: DEBUG (Optimization Disabled)" << endl;
#endif

    //	Простейшие циклы. Объясните суть происходящего.
    {
        // Цикл while надо использовать, когда неизвестно количество итераций (повторений) цикла.
        cout << "\n\nGradually eat out all the units:\n\n";
        unsigned short us = 0xff;
        while (us)
        {
            cout << hex << us << endl;
            us &= us - 1; // сбрасывает самый младший единичный бит
        }
        cout << hex << us << "\nDone\n"
             << dec;
        // Цикл for надо использовать, когда известно количество итераций и/или есть код подготовки.
        // Подсказка: odd - нечетое, even - четное.
        cout << "\n\nShow even-odd:\n\n";
        for (int i = 0; i < 10; i++)
        {
            if (i & 1)
                cout << i << " - odd\n";
            else
                cout << i << " - even\n";
        }
        // Когда нужно использовать цикл do-while?
        // в отличие от цикла с предусловием, он сначала выполнит действие, а потом будет проверять, продолжить ли их выплонять, или нет
        char c = ' ';
        do
        {
            if (c == 'a')
                cout << "\nAction is a delegate type in C#";
            else if (c == 'b')
                cout << "\nbreak is one of the 'leave' statements in all C-like languages";
            else if (c == 'c')
                cout << "\ncontinue is a 'go on' statement in all C-like languages";
            else if (c == 'd')
                cout << "\ndo-while is a rarely used loop statement in all C-like languages";
            else
                cout << "\nPlease read the rules of this loop";
            cout << "\n\nEnter chars: a, b, c, d (q - to quit):\n\n";
            cin >> c;
            if (c == 'q')
                cout << "\nI am going to leave the loop\n";
        } while (c != 'q');
        stop;
    }
    //	Логические условные операторы и циклы. Функция y = f(x) задана графиком
    //	Напишите фрагмент кода, который с шагом 0.1 вычисляет y = f(x)  и выводит в консольное окно значения x и y.
    //	  y
    //	  |
    //	 2|__________
    //	  |         /\
    //	  |        /  \
    //	  |       /    \
    //	  |______/      \__________  x
    //	  0      1   2   3
    // до 2 y=2x - 2, после y=-2x + 6
    // общий = знак * (2х - 4) + 2
    //	 Реалируйте 2 варианта этого алгоритма:   1. Используйте операторы if	 2. Используйте тернарные операции    ? :

    cout << "\n--- Graph y = f(x) (using if) ---\n";
    for (double x = 0.0; x <= 4.05; x += 0.1)
    {
        double y = 0.0;
        // if (x >= 1.0 && x <= 3.0)
        //     y = (x <= 2) * (2 * x - 4) - (x > 2) * (2 * x - 4) + 2;
        if (x >= 1.0 && x <= 3.0)
        {
            if (x <= 2.0)
            {
                y = 2.0 * x - 2.0;
            }
            else
            {
                y = 6.0 - 2.0 * x;
            }
        }

        cout << "x = " << x << "\t y = " << y << "\n";
    }

    cout << "\n--- Graph y = f(x) (using Ternary ?:) ---\n";
    for (double x = 0.0; x <= 4.05; x += 0.1)
    {
        double y = (x >= 1.0 && x <= 2.0) ? (2.0 * x - 2.0) : (x > 2.0 && x <= 3.0) ? (6.0 - 2.0 * x)
                                                                                    : 0;
        cout << "x = " << x << "\t y = " << y << "\n";
    }

    //	Напишите фрагмент, который с помощью for и switch реализует следующую логику. Если пользователь ввел:
    //	символ 'a',   ваш алгоритм выводит  "Ok" (в кавычках)
    //	символ 'b',   ваш алгоритм выводит  Bell (alert - звуковой сигнал)
    //	символ 'с',   ваш алгоритм выводит  число, которое равно количеству введенных символов
    //	символ 'Esc', ваш алгоритм выводит  "to quit use 'q'"
    //	символ 'q',   ваш алгоритм выводит  "Bye" и выходит из цикла ввода

    cout << "Enter chars: a, b, c, Esc, q (to exit):\n";
    int char_count = 0;
    for (;;)
    {
        char ch;
        cin >> ch;
        cin.ignore(numeric_limits<streamsize>::max(), '\n');
        char_count++;
        bool do_break = false;

        switch (ch)
        {
        case 'a':
            cout << "\"Ok\"\n";
            break;
        case 'b':
            cout << '\a';
            break;
        case 'c':
            cout << "Total chars entered: " << char_count << "\n";
            break;
        case 27:
            cout << "to quit use 'q'\n";
            break;
        case 'q':
            cout << "Bye\n";
            do_break = true;
            break;
        default:
            break;
        }
        if (do_break)
            break;
    }
    //	Побитовые операции:  |, &, ~, ^ и сдвиги >>, <<
    //	Поменяйте местами байты переменной flags и выведите результат в консолное окно unsigned short flags = 0xaabb;

    unsigned short flags = 0xaabb;

    flags = (flags >> 8) | (flags << 8);
    cout << "\n bits = 0x" << hex << flags;

    //	Для вывода в шестнадцатеричном виде используйте  cout <<"\n bits = " << hex << flags;
    //	В переменной unsigned char byte = 0x26;
    //      - установите в единицу 3-й бит (счет от нуля). Выведите результат.
    //	- инвертируйте два младших бита. Выведите результат.
    //      - обнулите 4 младших бита. Выведите результат.
    //	cout <<endl << hex << flags << endl<<dec<<flags;
    unsigned char byte = 0x26;
    byte |= (1 << 3); // 1000
    cout << "\n0x" << static_cast<int>(byte);
    byte ^= 0x03; // 0011
    cout << "\n0x" << static_cast<int>(byte);
    byte &= 0xF0; // 11110000
    cout << "\n0x" << static_cast<int>(byte);
} // Конец функции main()
