//  Проект для лабораторной работы по изучению особенностей
// системы команд, способов адресации процессоров x86 в 32-битном режиме

//*<=(1)=
	int iMas[10];
	int *pI;
	unsigned int i;
  //=(1)=>*/

int main() {
/*<=(2)=	
	int iMas[10];
	int *pI;
	unsigned int i;
  //=(2)=>*/

	// === Присваивание констант разной длины прямо и с использованием указателя
	iMas[3]=12;
	iMas[4]=12345;
	iMas[5]=12345678;
	iMas[6]=0x123456789ABCDE;

	pI=&iMas[2];
	*pI=0xAB12;

	// === Циклический фрагмент на языке высокого уровня ====
	for (i=0;i<9;i++) {			//  Организация цикла - вычисляем элементы массива
		if (i<=3 || i==7 )		//  Условный оператор - 
			iMas[i]=3*i+27;		// считаем по этой формуле 
	}	//  Здесь конец цикла
	return 0;
}
